# date : 20240129
# desc : 변수 설명

# 변수(Variable) - 변하는 수, 파이썬에서는 들어가는 종류나 크기에 제약이 없음
var01 = 10
print(var01)

var01 = 1000000000000000000000000000
print(var01)

var01 = 99999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999  # 보기 --> 자동줄바꿈(Alt + z)
print(var01)

var01 = False
print(var01)

var01 = 'Life is short, You need Python.'
print(var01)

# 단, 변수명을 지정시
## - 숫자로 시작하거나
## - 공백이 있거나
## - _이외의 특수문자가 있으면

_var02 = 1  # 언더바 시작은 되긴하나 되도록이면 쓰지말자
print(_var02)